Котельников_АБ_70153995/src/Documents/ПроведениеТестирования/ПроведениеТестирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроведениеТестирования</name>
  <basedOn>Document.ПроведениеСобеседования</basedOn>
  <registerRecords>AccumulationRegister.ОценкиКандидатов</registerRecords>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПроведениеСобеседования</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыТестирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Вакансия</name>
    <type>
      <types>DocumentRef.Вакансия</types>
    </type>
  </attributes>
  <attributes>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.Кандидаты</types>
    </type>
  </attributes>
  <attributes>
    <name>АнкетаВопросов</name>
    <type>
      <types>CatalogRef.Анкеты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяОценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокВопросов</name>
    <attributes>
      <name>Вопрос</name>
      <type>
        <types>CatalogRef.ВопросыДляАнкетирования</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветКандидата</name>
      <type>
        <types>EnumRef.ТипыОценкиОтвета</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Котельников_АБ_70153995/src/Enums/ТипыОценкиОтвета/ТипыОценкиОтвета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОценкиОтвета</name>
  <enumValues>
    <name>Отлично</name>
  </enumValues>
  <enumValues>
    <name>Хорошо</name>
  </enumValues>
  <enumValues>
    <name>Удовлетворительно</name>
  </enumValues>
  <enumValues>
    <name>Плохо</name>
  </enumValues>
  <enumValues>
    <name>ОченьПлохо</name>
  </enumValues>
</mdclass:Enum>

Котельников_АБ_70153995/src/Documents/ПроведениеТестирования/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
 	Если Объект.Ссылка.Пустая() Тогда	
		ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
		Объект.Ответственный = ТекущийПользователь.Сотрудник;
		Объект.АвторДокумента = ТекущийПользователь;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура АнкетаВопросовПриИзменении(Элемент)
	
	Если Объект.СписокВопросов.Количество() <> 0 Тогда
		ОтветПользователя = Ждать ВопросАсинх("При изменении анкеты список вопрос будет очищен. Продолжить?", РежимДиалогаВопрос.ДаНет,,, "Список вопросов будет очищен");
		Если ОтветПользователя = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Объект.СписокВопросов.Очистить(); 
	
	ВопросыАнкеты = ПолучитьВопросыАнкеты(Объект.АнкетаВопросов);
	
	Для Каждого Вопрос Из ВопросыАнкеты Цикл
		НоваяСтрока = Объект.СписокВопросов.Добавить();
		НоваяСтрока.Вопрос = Вопрос; 
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВопросыАнкеты(Анкета)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВопросыДляАнкетирования.Ссылка КАК Вопрос
		|ИЗ
		|	Справочник.ВопросыДляАнкетирования КАК ВопросыДляАнкетирования
		|ГДЕ
		|	ВопросыДляАнкетирования.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Анкета);	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	СписокВопросов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		СписокВопросов.Добавить(Выборка.Вопрос);
	КонецЦикла;
	
	Возврат СписокВопросов; 
				
КонецФункции

&НаКлиенте
Процедура РассчитатьРезультат(Команда)
	
	ОчиститьСообщения();

	Результат = 0;
	КоличествоВопросов = Объект.СписокВопросов.Количество();
	
	Для Каждого СтрокаТЧ Из Объект.СписокВопросов Цикл
		
		Если СтрокаТЧ.ОтветКандидата.Пустая() Тогда
			Индекс = Объект.СписокВопросов.Индекс(СтрокаТЧ); 
			ОбщегоНазначенияКлиент.ВывестиСообщение("Заполните все ответы кандидата для расчета общей оценки", "Объект.СписокВопросов[" + Индекс + "].ОтветКандидата");
			Возврат;
		КонецЕсли;
		
		Если СтрокаТЧ.ОтветКандидата = ПредопределенноеЗначение("Перечисление.ТипыОценкиОтвета.Отлично") Тогда
			Результат = Результат + 5;
		ИначеЕсли СтрокаТЧ.ОтветКандидата = ПредопределенноеЗначение("Перечисление.ТипыОценкиОтвета.Хорошо") Тогда
			Результат = Результат + 4;
		ИначеЕсли СтрокаТЧ.ОтветКандидата = ПредопределенноеЗначение("Перечисление.ТипыОценкиОтвета.Удовлетворительно") Тогда
			Результат = Результат + 3;
		ИначеЕсли СтрокаТЧ.ОтветКандидата = ПредопределенноеЗначение("Перечисление.ТипыОценкиОтвета.Плохо") Тогда
			Результат = Результат + 2;
		ИначеЕсли СтрокаТЧ.ОтветКандидата = ПредопределенноеЗначение("Перечисление.ТипыОценкиОтвета.ОченьПлохо") Тогда
			Результат = Результат + 1;
		КонецЕсли;
	КонецЦикла;
	
	Объект.ОбщаяОценка = Результат / КоличествоВопросов; 
		
КонецПроцедуры
